//**************************************************************************/
//《单片机技术》基础实验
//文件名称：beep.c
//功能概要：beep组件源文件（MXHAL版）
//开发人员：zyc
//开发日期：2025-3-17
/***************************************************************************/
//1.包含本组件头文件
#include "beep.h"

//2.定义相关的全局变量

//************************************************************************
//函数名称：BEEP_ON
//函数功能：
//函数功能：
//形式参数：
//返回的值：无
//************************************************************************
void BEEP_ON(void)
{
		HAL_GPIO_WritePin(HORN_CTL_GPIO_Port,HORN_CTL_Pin,GPIO_PIN_SET);
}

// 关闭蜂鸣器
void BEEP_OFF(void)
{
		HAL_GPIO_WritePin(HORN_CTL_GPIO_Port,HORN_CTL_Pin,GPIO_PIN_RESET);
}
